commands_templates/SetRelayOutputSettings0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/deviceIO/wsdl" xmlns:sch="http://www.onvif.org/ver10/schema">
   <soap:Header/>
   <soap:Body>
      <wsdl:SetRelayOutputSettings>
         <wsdl:RelayOutput token="?">
            <sch:Properties>
               <!--type: RelayMode - enumeration: [Monostable,Bistable]-->
               <sch:Mode>?</sch:Mode>
               <!--type: duration-->
               <sch:DelayTime>?</sch:DelayTime>
               <!--type: RelayIdleState - enumeration: [closed,open]-->
               <sch:IdleState>?</sch:IdleState>
            </sch:Properties>
            <!--You may enter ANY elements at this point-->
         </wsdl:RelayOutput>
      </wsdl:SetRelayOutputSettings>
   </soap:Body>
</soap:Envelope>